# IFCGuidKey Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGuidKey Class
Members See Also
---
IFCGuidKey is used for case-sensitive comparison of GUID values for maps and sets.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class IFCGuidKey : IDisposable
```

Visual Basic
---
```text
Public Class IFCGuidKey _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCGuidKey : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCGuidKey
# See Also
IFCGuidKey Members
Autodesk.Revit.DB.IFC Namespace